[
  {
    "course": "Introduction to Carnatic Music",
    "code": "HSS F347",
    "ic": "REENA CHERUVALATH",
    "bulletin": "Origins and History of Carnatic music; Basic concepts of svara, svaravalis, svarasthanas, aarohana, avarohana, sthayis; Concept of laya, tala, gati, nadai, different jaati's of taalams; Concept of raaga, Melakarta and janya; Ragalakshanam for some specific raagas; Notation of svaras, taalam  Brief biography of the Trinity, Purandaradasa, and other major composers; Concert formats and styles; Vocal or instrumental exercises including varisais, Saptataala alankaaras, Geetams, svarajati, keertanams; Listening practice",
    "review": "Theory classes are held once a week while practical classes twice a week. Attendance is compulsory and carries weightage in the grade. The evaluative components also include written midsem and endsem papers as well as practical midsem and endsem exams. The assignment consists of a seminar which involves a group presentation on a topic given by the teacher. Practical classes might  be a bit hard for people who are not well-versed with music but overall, an interesting course. There is also an audit course in Carnatic music for people who are interested. "
},
{
    "course": "Modern Political Concepts",
    "code": "GS F211",
    "ic": "SOLANO JOSE DA SILVA",
    "bulletin": "Nature and scope of political science; emergence and basis of the state; rights and duties; forms of government; democracy, fascism, capitalism, socialism, anarchism, communism, Maoism, radicalism and Gandhism",
    "review": "The course is well structured and begins on a very fundamental note of human nature. The crux of concepts, science, arts is discussed in detail after which discussions on politics, what it means, its various definitions, the need to study politics begin. Later on, the above mentioned topics are taught and discussed theoretically. Making informative notes in the classroom hours is highly encouraged by the IC. The course typically involves midsem, 2 group assignments and Compre. The exams usually consist of 2-3 questions which are essay-type. Midsem and compre are ‘open class notes’ exams. No photocopies are allowed. The assignments are also essay-type and require extensive research. He checks the assignments very thoroughly, so copy pasting or poor editing and grammar matter a lot. Attendance is also taken. The grading is extremely vicious with a C/C- at average. Only a very few people get an A"
},
{
    "course": "Development Economics",
    "code": "GS F234",
    "ic": "Dr. R. P. PRADHAN",
    "bulletin": "Idea of development; Classical theories - Smith, Ricardo, Marx; Rostow, Keynes, Neo-classical school of thought; Modernisation school; Human Development; Issues of Economic Development; India’s development - planning, challenges and opportunities",
    "review": "This is a very broad course focussing on the challenges faced by developing countries. Attendance is not compulsory but topics are often done in class which aren't present in the slides nor can be located in the reference books. The evaluation scheme includes mid-term(30%), a written assignment(20%) and compre(50%). There aren’t any surprise quizzes and exams are based on slides and some extra topics covered in the class. He gives a lot of weightage to properly labelled diagrams in the papers, so make sure you’re well-versed with the graphs and diagrams taught in class and present in the slides"
},
{
    "course": "Effective Public Speaking ",
    "code": "GS F245",
    "ic": "SHALINI UPADHYAY",
    "bulletin": "Principles of public speaking; importance of effective listening; use of body language; characteristics of voice; ways to control stage fright; measures to develop confidence; audience analysis; modes of delivery; organization of speech; speeches for special occasion: welcome, introduction, felicitation, farewell, valedictory, inaugural; impromptu and extemporaneous speeches; meetings, group discussions, professional presentations, interviews. (This course is extensively practice-oriented. Theoretical guidelines also will be given to the students for achieving effectiveness in public speaking. Students would be asked to prepare and deliver a number of talks and presentations. Comments and discussions will follow each presentation so as to provide the students opportunity to correct themselves. Group discussions and presentations will be recorded and projected for them to observe their organization, body language and understand the nuances of the characteristics of their voice. Evaluation components will be designed to assess the students’ ability to listen actively and speak effectively. The new language laboratory will be used to enable the students to listen to speeches by eminent leaders and renowned personalities who were/are able to attract the masses with their powerful speeches. The lab would also be used to conduct group discussions through computers)",
    "review": "Theory is covered only in 3-4 classes. Most of the evaluation is done through activities such as: Self Introduction (In a creative way), Storytelling, Impromptu, Debate , Group Discussion and. The take-home assignment consisted of Diary submissions and very short film-making. There will be a midsem written paper  as well as a comprehensive written paper. The best part is how every speaker does creative things to catch audience's attention. It’s a well structured course. The grading is decent - av+2/3 is B.  This is a good course only if you are ready to slog for it throughout the semester. In some cases you will have to give priority to EPS over CDCs because of the extensive preparations required before classes. However, it is well worth it with the amount of learning that you gain out of it"
},
{
    "course": "Applied Philosophy",
    "code" : "GS F312",
    "ic": "Sreejith K.K",
    "bulletin": "Introduction to Philosophy; Argumentative Techniques; Euthanasia; Poverty; Abortion; Justice(Rawls); Utilitarianism; Freedom of Expression; Epistemic Injustice; Nature of Technological Knowledge; Values in Engineering Design",
    "review": "Applied Philosophy is an accessible introduction to ethical issues such as euthanasia, abortion and poverty as well as issues of metaphysics and epistemology. The first few classes are an introduction to basic philosophical concepts. The evaluated components include the usual midsem and compre exams as well as a term paper and group discussion on a selected topic. Attendance is required during the group discussions. Grading is lenient with B's given out around the average"
},
{
    "course": "Symbolic Logic",
    "code": "HSS F236",
    "ic": "REENA CHERUVALATH",
    "bulletin": "Introduction to Logic; Truth, Validity, Soundness; Categorical Propositions; Square of Opposition; Categorical Syllogism and their Validity; Validity; Sentential Connectives; Propositional Calculus; Truth Tables; Formal Proof of Validity - Rules of Inference and Replacement; Proving Invalidity; Conditional Proof, Indirect Proof; Quantification Theory; Symbolizing Relations; Binary Relations. ",
    "review": "Evaluation components of the course consists of Mid Sem ,Group assignment, Surprise Quiz and Compre. There is no weightage for attendance but to get a good grade we have to attend classes as it is difficult to learn those concepts on our own. Being regular in classes and a little practice helps to score easily. Grading is okay. "
},
{
    "course": "Cinematic Art",
    "code": "HS F332",
    "ic": "PARICHAY PATRA",
    "bulletin": "Introduction to Cinema; Early Cinema; Sound and Colour; Realism and Formalism; French New Wave, Indian Cinema; South Indian Cinema; Stardom and Cine-politics; Film Criticism; Genre Criticism; Auteur Criticism; Experimental Cinema; Cinema and other Arts; Contemporary Cinema; Digital Cinema ",
    "review": "The course is structured well and is very interesting. The evaluation components consist of midsem, compre, a written assignment and an open-book test. Guest lectures were held on a few topics. Attendance is not compulsory and the slides, essays and other readings are sufficient to score well, provided you write decently and can come up with valid points. Weekly film screenings are held every Saturday evening, however they are not mandatory to attend. The IC is extremely helpful. Grading is okay with a B at a little above average. "
},
{
    "course": "Professional Ethics",
    "code": "HSS F343",
    "ic": "REENA CHERUVALATH",
    "bulletin": "Ethics, nature and purpose; ethical theories; ethics in business and management; ethics in engineering, global ethical issues",
    "review": "Course is easy and attendance carries some weightage (20%). Other evaluation components include one seminar apart from Midsem(30%) and Compre(40%). The seminar involves a presentation(10%) and is easy to score in. For the midsem and compre, read the slides and the reference material thoroughly . The grading is good and you can easily get good grades if you’re prepared to attend all classes and frame your answers in the exams well"
},
{
    "course": "Post Modernism",
    "code": "HSS F226",
    "ic": "NILAK DATTA",
    "bulletin": "Postmodernism, The Postmodern Condition, History of Postmodernism in brief, Pluralism, Eclecticism, Polysemy, Intertextuality, Metanarratives, Language Games, Parody, Pastiche, Simulation, Postcolonialism, Commodification, Deconstruction and New Historicism, Creativity, Critical Judgment, Ethical and Social Understanding, analysis of postmodern cultural artifacts and practices from fine art, music, theology, literature, and film alongside primary texts by the leading theorists of postmodernism",
    "review": "This course talks about the shift in society from a “modern” to a “postmodern” one. Postmodernism in a way is the study of consumer culture (which in turn is a study of American culture). The course is structured in a way that it encompasses the thoughts of a wide range of philosophers such as Harvey, Jencks, Lyotard, Baudrillard, etc. and also involves a couple of movies (Terminator II:Judgement Day and The Matrix) along with a novel (White Noise). Evaluative components include a class assignment(quiz mostly), 2 short papers on application of postmodernism in the real world, a 15-minute group presentation about a post-modern film of one’s choice. The midsem and compre test include long-answer questions of your understanding of the concepts and about the occurrences of the same in films/books. The course becomes fairly easy if you attend classes regularly. The grading is pretty fair, although a number of students drop the course sooner or later"
},
{
    "course": "Introduction to Developmental Studies",
    "code": "HSS F232",
    "ic": "PUSHKAR",
    "bulletin": "History of development; meanings of development; Key development thinkers: Smith, Marx, Liszt, Keynes, Prebisch, Friedman; 20th century perspectives on development: dependency, modernization, human development, post- and anti-development theories; Models of development: ISI and neoliberalism; Themes in comparative international development: environment, health, gender, foreign aid, social and human rights",
    "review": "Course mainly is about development and case studies of countries like India, South Korea, Europe and USA and many other countries like Kenya. Using concepts like modernization, globalization and dependency theories, all case studies are evaluated and questions in exams are based on open minded answers. It is about what we think and nothing to mug up as such, we just need to look at different perspectives of development and elaborate on how the country developed and why not if it didn't.  Attendance is not compulsory and is rarely taken. The course has some overlapping content with development economics. The grading is  good with a B given out at Av-5. The course is not very difficult as it is just imagining real life situations around country and elaboration based on the your view about this country. If you've MUNed before, you'd love it. There are 2 assignments. The first one was a Review of Websites related to UN and development(Pre-midsem). The second one was  a choice between giving a presentation on case study of any country of one’s choice or writing a paper/short essay on the case study most popularly related to Development or helping the teacher in doing research in his work for the semester( which was asked in the start of semester). The midsems and Compre were out of 30 each and they just had 2 essays to be written overall in the paper. The answer were expected to be open ended and keeping in mind the concepts covered in the class and elaboration based on it. Being expressive helps as well as being tidy on the paper does.  "
},
{
    "course": "Ecocriticism",
    "code": "HSS F349",
    "ic": "RAYSON K ALEX",
    "bulletin": "Defining Ecocriticism; Interdisciplinarity; Ecosystem and Biodiversity; Ecology and Environment; Developmental Ecology; Ecocritical Concepts; Literary Ecocriticism; Application of Ecocritical Principles in Literature - tinai Criticism; Deep Ecology; Bioregionalism - Cultural Ecocriticism; Ecocinema - Debates on Anthropocentrism and Biocentrism/Ecocentrism; Food documentaries; Animal Studies; Ecophobia; Gaia Theory; Ecocriticism and Society; Ecopolitics and Activism; Ecospirituality and Ecosophy; Practical Ecocriticism",
    "review": "Classes are interactive. The knowledge of the course content is not very satisfying, you need to have a very very open mind and an incredible ability to accept theories to appreciate the content . However, the debates proposed in this course are very relevant and the context of the courses is appropriate.The examinations are very trick with heavy focus is placed on accurate understanding of the concepts. A documentary needs to be submitted at the end of the course and seminar is also part of the evaluation components. Overall its an abstract course which should be good for students interested in literary appreciation and classes with good activities"
},
{
    "course": "Post Colonial Literatures",
    "code": "HSS F340",
    "ic": "K A GEETHA",
    "bulletin": "Introduction; Effects of colonialism in terms of cultural alienation; Analysis of the construct of nation and nationalism; Impact of colonial language on ex-colonies; Intersection of sexism and racism in post colonial societies; Role of memory in community, home and belonging; Hybridization and Cosmopolitanism in post-colonial societies; Impact of globalisation in post-colonial world; ",
    "review": "The course is interesting if you like literature and probably to your advantage if you have a flair for writing. There is no attendance component. The class assignments include a take-home, individual poem analysis; a group oral presentation of a short story analysis; and another take-home, group presentation. Apart from these, the midsem and comprehensive exams are held with essay-type questions. There is no attendance component"
},
{
    "course": "International Relations",
    "code": "HSS F346",
    "ic": "R.P. Pradhan",
    "bulletin": "Introduction; A survey of int’l politics since the 20th century – the Cold War and after; Realism; Neo-realism; Liberalism; Neo-Functionalism & Supra-Nationalism; Constructivism; Marxism; The Cold War & Beyond : Foreign Policy; Financial Diplomacy & Strategic Security Paradigm; Cuba, Vietnam, Afghanistan; 9/11 and the clash of ideology & civilizations; Financial Diplomacy; ASEAN & Free Market Diplomacy; Strategic Security Paradigm; Maritime Security; Terrorism & Foreign Policy India and the World; India & her Neighbours; India and the Superpowers; India and China; India and Pakistan",
    "review":  "The grading is okay. There is not a lot of difference between the highest and the average of the course.The classes are fun if your interested in historical anecdotes and stories dealing with bilateral relations between countries and importance of international relations. The teacher has loads of stories and this is what takes up most of the time of the class.There is no attendance component. The midsem and compre papers usually have 2-3 long subjective questions in which he expects you to answer, using the anecdotes and stories discussed in class, so going to classes makes the paper very easy to attempt. There is one assignment after Midsem which requires you to find an untold story in history which appreciates the importance and impact of international relations, grading is pretty relaxed in the assignment. Attendance is not an evaluative component and being thorough with the slides and class notes is enough to get a good grade"
},
{
    "course": "Creative Writing",
    "code": "GS F241",
    "ic": "AMITENDU BHATTACHARYA",
    "bulletin": "Principles of creative writing; stimulating creative activity; techniques of creating images; constructing events and creating characters, writing short stories, plays and poems, writing critical essays on works of art. The course will require from the student a comprehensive report on the techniques learnt and include samples of his creative writings",
    "review": "Lots of reading in class, little to no homework (just one term paper to be submitted at the end of the sem), attendance policy is lax, all quizzes are announced. Midsem and compre with essay-type questions. For the same reason, it's recommended that you take this course only if you have an interest and some ability in writing, because most people who take this course will be people with literary inclination"
},
{
    "course": "Critical Analysis of Literature and Cinema",
    "code": "GS F322",
    "ic": "GEETHA B",
    "bulletin": "Creativity and Aesthetics; An overview of Major Movements in Literature and Cinema; Interpretationof Selected Works; Cinema & Art; Understanding Drama: Theme, Character, Plot, form; Understanding Poetry: Diction, Imagery, Symbolism, Structure and Form, Personification, Apostrophe, Sound and Rhythm; Understanding fiction:Setting, Point of View, Plot and Character; Understanding Short Fiction: Meaning and message, Style and Coherence; Understanding Cinema: Plot; Character; Screenplay; Linguistic, Social, Musical codes; Cinematic Codes; Camera Work",
    "review": "The course mainly involves reading around 10 short stories, 2-3 long movies, 1-2 short films, 1-2 poems, and 1-2 plays. Reading elements of writing and filmmaking including camera work, the progress of the plot and what constitutes a piece of movie/literature. Good English is a slight advantage. If you like to ponder over books and movies and to discuss them and their interpretations, this course will be easy for you. Classes are not very hectic and attendance is not compulsory. Assignments include an analysis on a book/ movie and giving a presentation on it and one in-class analysis of a short movie that you’ll be shown in class on the spot. Exams consist of medium/long answer-type questions about elements of writing and filmmaking; direct character analyses; theme-based, plot-based, symbolism-based questions. Be sure to make references from the pieces in the syllabus"
},
{
    "course": "Introductory Philosophy",
    "code": "HSS F235",
    "ic": "Sreejith K.K",
    "bulletin": "Introduction to Philosophy; Logical Fallacies; Pre-Socratic Greek philosophy; Socrates, Aristotle, Plato(ideas, virtues, society); Continental Rationalism; Descartes; British Empiricism; David Hume(nature of knowledge, god, ethics); Kant(duty); Mill(happiness); Existentialism; Introduction to Indian Philosophy; Vedas and Upanisads; Atman and Brahman; Vedanta system; Sankara; Ramanuja; Nyaya; Atomism; Yoga; Buddhism and Jainism",
    "review": "This course covers major philosophers and their schools of thought from pre-Socratic times up to Kant. Indian schools are also covered later. The evaluated components include the usual midsem and compre exams as well as a term paper and group discussion on a selected topic. Attendance is required during the group discussions. Grading is lenient with B's given out around the average"
},
{
    "course": "English Literary Forms and Movements",
    "code": "H SS F337",
    "ic": "AMITENDU BHATTACHARYA",
    "bulletin": "This course is designed to provide a historical perspective on major forms and movements in English Literature and to develop an insight into various social, religious and other influences on their birth and growth. The course will cover the entire range of literature from renaissance and reformation to modern times. ",
    "review": "Very interesting course material. Easy papers and evaluation. Might not find the classes engaging at all times, so take it only if you are interested in Literature and you will have a great time. Professor is not bad, knows his stuff well. Attendance isn't important but advised" 
},
{
    "course": "Current Affairs",
    "code": "BITS C393/ GS F243",
    "ic": "BASAVADATTA MITRA",
    "bulletin": "Introduction, importance and scope; domains: political, social, religious, scientific, developmental, etc.; categories: controversial, non controversial, neutral; sources of information: newspapers, magazines, posters, pamphlets, manifestoes, etc.; reading skills: skimming, scanning, extensive and intensive reading; understanding, interpreting and analysing news, events and information; forming, balancing and expressing opinion",
    "review": "Advisable to sit in for the classes and be participative. There are 2 seminars. "
},
{
    "course": "Dynamics of Social Change",
    "code": "GS F231/ SOC C211",
    "ic": "PRAGYAN PARAMITA BARIK",
    "bulletin": "Nature of society, social institutions; concept and nature of socio-cultural change, obstacles, rate and direction of change; factors of social change : ideological, economic, technological and political demographies; agencies of social change education, leadership, propaganda, legislative reforms; five-year plans and social change, peasant and land reform, bhoodan and gramdan; changing pattern of family, marriage, caste and religion",
    "review": "They had some pretty interesting theories actually. We had presentations and the instructor was strict about it. I think we learnt as much on how to present as well as on the forces and aspects of social change. Not how to present, How to do a proper social project, and the in-class debates were fun. The exams have questions mostly on what is covered in the class"
},
{
    "course": "Introductory Psychology ",
    "code": "PSY C211/ GS F232",
    "ic": "LAYLA MASCARENHAS",
    "bulletin": "The development of psychology as a science -- individual and the environment; nature; kinds and determinants of perceptions; response mechanism and kinds of responses, motivations, modifications of behaviour through learning, memory and transfer of training; thought processes, problem solving and creative thinking; nature and characteristics of psychological tests; nature and evaluation techniques of intelligence and personality",
    "review": "Very interactive. You sure need to take this if human nature intrigues you. A lot to learn! Seminar/GD will be there. Attendance will matter because of a lot of evaluation components but the classes are interesting. The course tests both the theory and application part through midsem and compre"
},
{
    "course": "Reporting and Writing for Media ",
    "code": "GS F244",
    "ic": "MANISHA DIXIT",
    "bulletin": "Reporters and their functions; What makes news;Analysing the components; Getting the information and putting it together; Organizing a newsstory; Building colour into news stories; Fighting the formula story ; Writing Leads; Message molecules ,Vocab and grammar, Human Interest and Depth Report; Finding and using news sources; Basics of ethics in Journalism",
    "review": "This course has been added this year. Till last year a similar course named journalism  was being offered by the same instructor. Description(Journalism) :  The course structure is concise and relatively easy; Classes are interactive. There was a 10% weightage of attendance and 2 surprize quizzes of 7% each apart from T1/2. The course focuses mostly on reading and writing articles may help in inculcating a reading habit. Grading is good"
},
{
    "course": "Contemporary India",
    "code": "GS F332/ HUM C312",
    "ic": "MADHVI GUPTA",
    "bulletin": "Topics will include some or all of the following: economic process; contemporary Indian planning and industry; political processes; Contemporary Indian political scene and Indian administration: India and the contemporary world; social processes: contemporary Indian educational scene; religion and caste system; Indian science; Indian women; cultural processes; contemporary Indian art, music, dance, theatre, cinema and literature",
    "review": "The course covers Indian Progress from 1940’s to present scenario. The course syllabus is NCERT Political science textbook. the course is very factual and has a lot of slides/notes to be studied from. A presentation of 20% is also a part of evaluation components"
},
{
    "course": "Cultural Studies",
    "code": "GS F242",
    "ic": "K A GEETHA",
    "bulletin": "Introduction to Cultural studies, Importance of cultural studies, types of cultural studies, relation to Critical theory, relation to Literary Criticism. Introduction to theories such as Communication studies, Film studies, Feminist theory, Art history/Criticism, Societal impact, business relevance, introduction to myriad practices, institutions, beliefs",
    "review": "It is presented in three major parts to the students. First, established literary theories are taught, which include Structuralism, Post-Structuralism, Psychoanalytic Theory, Marxist theory, Post-Colonial Theory among others. After this foundation, key concepts of cultural studies as theorized by various thinkers are presented, which include theories about identity, subjectivity, discourse and power. A significant time is also allotted to concepts such as Modernism, Post Modernism, and Fordism etc. This is considered the most critical as well as the toughest part of the course due to the degree of abstraction of these concepts. Finally, the course moves on to practical aspects of cultural studies such as studying and analyzing consumerism, mall cultures, video game cultures etc. The evaluation of this course gives a lot of emphasis to continuous evaluation and consists of Surprise quizzes as well as presentations/assignments in addition to Midsem and the Comprehensive Exam, which lowers the weightage of the latter part significantly. Attendance, along with participation in the classroom during presentations is also given weightage. This course is generally rated between moderate and tough, depending upon the students’ interest and ability to assimilate abstract concepts. Although prescribed textbooks are available, one cannot refer to a single source for a thorough knowledge and has to use sources like Wikipedia often, to get a clearer understanding"
}
]